<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
  <link href="https://gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.129.0">

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>PIMPL idiom in C&#43;&#43; &middot; The Bored Octopus</title>
  <meta name="description" content="" />

    
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/en/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/en/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/en/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/en/css/hyde.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/en/css/fontello.css">
  
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  
  <script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-MML-AM_SVG">
</script> 
<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    "HTML-CSS": {
    styles: {

</span></span><span class="line"><span class="cl">  <span class="o">~</span><span class="n">person</span><span class="p">()</span> <span class="o">=</span> <span class="k">default</span><span class="p">;</span>
</span></span><span class="line hl"><span class="cl">  <span class="kt">uint16_t</span> <span class="nf">age</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">name</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">last</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">private</span><span class="o">:</span>
</span></span><span class="line hl"><span class="cl">  <span class="kt">uint16_t</span> <span class="n">m_age</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_name</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_last</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">};</span></span></span></code></pre></div>
<p>So I am going to compile the library as before. The client code has no
information about the change and has no way to know about <code>age</code>
variable. The part of API that client has been aware of, has not
changed at all. All functions, the constructor and members, from an
API point of view is the same as before. So we would expect the code
to run properly with no change. Sadly that&rsquo;s not the case. Now if I
try to run client&rsquo;s software, it will crash:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">free<span class="o">()</span>: invalid pointer
</span></span><span class="line"><span class="cl">Aborted <span class="o">(</span>core dumped<span class="o">)</span>
</span></span><span class="line"><span class="cl">$ <span class="nb">echo</span> <span class="nv">$?</span>
</span></span><span class="line"><span class="cl"><span class="m">134</span></span></span></code></pre></div>
<p>To see why this happens, we must take a look at the memory layout of
objects in use. First let&rsquo;s see initial version of the library
(<code>2.1.4</code>):</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-plain" data-lang="plain"><span class="line"><span class="cl"> 0 | class person
</span></span><span class="line"><span class="cl"> 0 |   class std::__cxx11::basic_string&lt;char&gt; m_name
</span></span><span class="line"><span class="cl">32 |   class std::__cxx11::basic_string&lt;char&gt; m_last
</span></span><span class="line"><span class="cl">   | [sizeof=64, dsize=64, align=8,
</span></span><span class="line"><span class="cl">   |  nvsize=64, nvalign=8]</span></span></code></pre></div>
<p>After adding <code>age</code>, we can observe how memory layout has changed. The
address of <code>m_name</code> and <code>m_last</code> now differ:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-plain" data-lang="plain"><span class="line"><span class="cl"> 0 | class person
</span></span><span class="line"><span class="cl"> 0 |   uint16_t m_age
</span></span><span class="line"><span class="cl"> 8 |   class std::__cxx11::basic_string&lt;char&gt; m_name
</span></span><span class="line"><span class="cl">40 |   class std::__cxx11::basic_string&lt;char&gt; m_last
</span></span><span class="line"><span class="cl">   | [sizeof=72, dsize=72, align=8,
</span></span><span class="line"><span class="cl">   |  nvsize=72, nvalign=8]</span></span></code></pre></div>
<p>But why crash happens? Although no member variable has been used
directly by the client code, and the fact that the library is a
position-independent code, one may expect the client code to work with
the new version. The reason for this behaviour is the ABI break caused
by different sizes of the class. The stack on the client-side is now
corrupted and destructor call for <code>people</code> will corrupt memory. There
are other examples we can demonstrate that clients code will directly
segfault instead. There exist even more complicated situations in
which there is absolutely no change on the API but the ABI breaks.</p>
<h3 id="fix-abi-breaks-using-pimpl">Fix ABI breaks using PIMPL</h3>
<p>In order to implement PIMPL idiom, we&rsquo;ll need to change the <code>person</code>
class like this:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-cpp" data-lang="cpp"><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">LIBFOO_API</span> <span class="n">person</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="k">public</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="n">person</span><span class="p">(</span><span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">name</span><span class="p">,</span> <span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">last</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="o">~</span><span class="n">person</span><span class="p">()</span> <span class="o">=</span> <span class="k">default</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">name</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">last</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">private</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="k">struct</span> <span class="nc">details</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">      <span class="n">details</span><span class="p">(</span><span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">name</span><span class="p">,</span> <span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">last</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">      <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_name</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">      <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_last</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="p">};</span>
</span></span><span class="line"><span class="cl">  <span class="n">details</span><span class="o">*</span> <span class="n">m_impl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">};</span></span></span></code></pre></div>
<p>You can use smart pointers like <code>std::uniqur_ptr</code> instead of raw
pointers. Also, you may move the definition of <code>details</code> to another
domain, like a non-API header or the beginning of the source file as
well. That would provide a stronger level of encapsulation and
separation of implementation. Note that <code>details</code> already is out of
public API since it has private access level. If you do apply both
aforementioned changes, the final class would look like this:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-cpp" data-lang="cpp"><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">LIBFOO_API</span> <span class="n">person</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="k">public</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="n">person</span><span class="p">(</span><span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">name</span><span class="p">,</span> <span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">last</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="o">~</span><span class="n">person</span><span class="p">()</span> <span class="o">=</span> <span class="k">default</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">name</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">last</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">private</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="k">struct</span> <span class="nc">details</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">unique_ptr</span><span class="o">&lt;</span><span class="n">details</span><span class="o">&gt;</span> <span class="n">m_impl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">};</span></span></span></code></pre></div>
<p>Let&rsquo;s go ahead and compile our new PIMPL-ready library and also the
client&rsquo;s code. Now we have a version of the library which provides an
ABI, resilient to changes. The memory layout now looks like the below
code. We can observe that the layout includes only a <strong>pointer to
implementation</strong>. There is no trace of any data whatsoever.</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-plain" data-lang="plain"><span class="line"><span class="cl"> 0 | class person
</span></span><span class="line"><span class="cl"> 0 |   struct person::details * m_impl
</span></span><span class="line"><span class="cl">   | [sizeof=8, dsize=8, align=8,
</span></span><span class="line"><span class="cl">   |  nvsize=8, nvalign=8]</span></span></code></pre></div>
<p>Obviously, we must also modify the implementation details. Now all
functions need to pass an extra level of indirection to access
underlying data. For example <code>name()</code> would look like this:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-cpp" data-lang="cpp"><span class="line"><span class="cl"><span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">person</span><span class="o">::</span><span class="n">name</span><span class="p">()</span> <span class="k">const</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">m_impl</span><span class="o">-&gt;</span><span class="n">m_name</span><span class="p">;</span>
