<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fa" lang="fa">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.113.0">

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>حفظ سازگاری عقبگرد با تکنیک PIMPL &middot; اختاپوس خسته</title>

    
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/hyde.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/fontello.css">
  <link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/hyde-rtl.css"><link type="text/css" rel="stylesheet" href="https://soroush.github.io/fa/css/poole-rtl.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  
  <script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-MML-AM_SVG">
</script> 

</span></span><span class="line hl"><span class="cl">         <span class="k">const</span> <span class="kt">uint16_t</span> <span class="n">age</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="o">~</span><span class="n">person</span><span class="p">()</span> <span class="o">=</span> <span class="k">default</span><span class="p">;</span>
</span></span><span class="line hl"><span class="cl">  <span class="kt">uint16_t</span> <span class="nf">age</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">name</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">last</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">private</span><span class="o">:</span>
</span></span><span class="line hl"><span class="cl">  <span class="kt">uint16_t</span> <span class="n">m_age</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_name</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_last</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">};</span></span></span></code></pre></div>
<p>حالا به همان منوال قبلی کتابخانه رو کامپایل می‌کنیم. برنامهٔ کاربر هیچ
اطلاعی از وجود age نداره و ازش استفاده‌ای هم نکرده. بخشی از API که کد
کاربر از اون اطلاع داشته هیچ تغییری نکرده. بنابراین انتظار داریم
برنامهٔ مقصد بدون هیچ تغییری به درستی کار کنه. اما اگر برنامه رو اجرا
کنیم مشاهده می‌کنیم که کرش میکنه:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">free<span class="o">()</span>: invalid pointer
</span></span><span class="line"><span class="cl">Aborted <span class="o">(</span>core dumped<span class="o">)</span>
</span></span><span class="line"><span class="cl">$ <span class="nb">echo</span> <span class="nv">$?</span>
</span></span><span class="line"><span class="cl"><span class="m">134</span></span></span></code></pre></div>
<p>برای فهمیدن دلیل این اتفاق باید نگاهی به لی‌آوت آدرس‌های کتابخانه
بیندازیم. اول نسخهٔ ابتدایی رو می‌بینیم:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-plain" data-lang="plain"><span class="line"><span class="cl"> 0 | class person
</span></span><span class="line"><span class="cl"> 0 |   class std::__cxx11::basic_string&lt;char&gt; m_name
</span></span><span class="line"><span class="cl">32 |   class std::__cxx11::basic_string&lt;char&gt; m_last
</span></span><span class="line"><span class="cl">   | [sizeof=64, dsize=64, align=8,
</span></span><span class="line"><span class="cl">   |  nvsize=64, nvalign=8]</span></span></code></pre></div>
<p>بعد از اضافه کردن متغیر age اما ساختار حافظه طبیعتاً متفاوت
هست. آدرس‌های متغیرهای قبلی، یعنی <code>m_name</code> و <code>m_last</code> عوض شده:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-plain" data-lang="plain"><span class="line"><span class="cl"> 0 | class person
</span></span><span class="line"><span class="cl"> 0 |   uint16_t m_age
</span></span><span class="line"><span class="cl"> 8 |   class std::__cxx11::basic_string&lt;char&gt; m_name
</span></span><span class="line"><span class="cl">40 |   class std::__cxx11::basic_string&lt;char&gt; m_last
</span></span><span class="line"><span class="cl">   | [sizeof=72, dsize=72, align=8,
</span></span><span class="line"><span class="cl">   |  nvsize=72, nvalign=8]</span></span></code></pre></div>
<p>اما چرا کرش اتفاق می‌افته؟ اون هم با وجود این که هیچ عضوی از کلاس در کد
کاربر به طور مستقیم استفاده نشده؟ دلیلش اینه که سایز کل کلاس تغییر
کرده. بنابراین کد آزادسازی حافظه برای اون کلاس دیگه به درستی فراخوانی
نمیشه. مثال‌های دیگری هم وجود داره. مثلا وقتی به اعضای کلاس از طریق
توابعی در هدر دسترسی پیدا می‌کنیم. در این حالت مستقیماً خطای
Segmentation Fault دریافت می‌کنیم و کار به Destructor نمی‌کشه. حتی
حالت‌هایی وجود داره که API اصلاً تغییری نمی‌کنه اما ABI تغییر ناسازگار
داره. مثلاً فرض کنید تابع ‪<code>age()</code>‬ رو اصلاً نیاز نداشتیم و تغییر صرفاً
شامل اضافه کردن چند عضو جدید به کلاس می‌بود.</p>
<h3 id="حل-مشکل-سازگاری-با-pimpl">حل مشکل سازگاری با pimpl</h3>
<p>برای پیاده کردن تکنیک pimpl تعریف کلاس <code>person</code> رو به شکل زیر تغییر
میدیم.</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-cpp" data-lang="cpp"><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">LIBFOO_API</span> <span class="n">person</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="k">public</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="n">person</span><span class="p">(</span><span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">name</span><span class="p">,</span> <span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">last</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="o">~</span><span class="n">person</span><span class="p">()</span> <span class="o">=</span> <span class="k">default</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">name</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">last</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">private</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="k">struct</span> <span class="nc">details</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">      <span class="n">details</span><span class="p">(</span><span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">name</span><span class="p">,</span> <span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">last</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">      <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_name</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">      <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">m_last</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="p">};</span>
</span></span><span class="line"><span class="cl">  <span class="n">details</span><span class="o">*</span> <span class="n">m_impl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">};</span></span></span></code></pre></div>
<p>توجه داشته باشید که می‌تونید به جای اشاره‌گر معمولی از اشاره‌گر هوشمند
مثل <code>std::unique_ptr</code> هم استفاده کنید. همچنین می‌تونید پیاده‌سازی
<code>details</code> رو به یک فایل دیگه (خارج از API) منتقل کنید. البته از آنجایی
که سطح دسترسی <code>private</code> داره همین الانش هم داخل API عمومی نیست؛ با این
حال اگر دوست داشته باشید می‌تونید خیلی راحت ببریدش داخل کدهایی که دیده
از دید کاربر پنهان هست. مثلاً یک هدر مجزا برای خودش و یا ابتدای فایل
cpp جاهای مناسبی هستند. اگر این کارها رو هم انجام بدیم کلاس ما به این
شکل در میاد:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-cpp" data-lang="cpp"><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">LIBFOO_API</span> <span class="n">person</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="k">public</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="n">person</span><span class="p">(</span><span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">name</span><span class="p">,</span> <span class="k">const</span> <span class="n">std</span><span class="o">::</span><span class="n">string</span><span class="o">&amp;</span> <span class="n">last</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="o">~</span><span class="n">person</span><span class="p">()</span> <span class="o">=</span> <span class="k">default</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">name</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">last</span><span class="p">()</span> <span class="k">const</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">private</span><span class="o">:</span>
</span></span><span class="line"><span class="cl">  <span class="k">struct</span> <span class="nc">details</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">std</span><span class="o">::</span><span class="n">unique_ptr</span><span class="o">&lt;</span><span class="n">details</span><span class="o">&gt;</span> <span class="n">m_impl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">};</span></span></span></code></pre></div>
<p>طبق روال قبل کتابخانه رو کامپایل و لینک می‌کنم. برنامهٔ کاربر رو هم با
کتابخانهٔ جدید کامپایل کرده و لینک می‌کنیم. حالا ما یک نسخه‌ای از
کتابخانه رو داریم که تکنیک pimpl رو پیاده‌سازی کرده. اگر به لی‌آوت
حافظه‌ش نگاه کنیم متوجه میشیم که اثری از اعضای پیاده‌سازی وجود نداره و
طبیعتاً فقط یک <strong>اشاره‌گر به پیاده‌سازی</strong> وجود داره:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-plain" data-lang="plain"><span class="line"><span class="cl"> 0 | class person
</span></span><span class="line"><span class="cl"> 0 |   struct person::details * m_impl
</span></span><span class="line"><span class="cl">   | [sizeof=8, dsize=8, align=8,
</span></span><span class="line"><span class="cl">   |  nvsize=8, nvalign=8]</span></span></code></pre></div>
<p>و طبیعتاً باید پیاده‌سازی توابع کلاس رو هم عوض کنیم طوری که به جای
فراخوانی اعضای کلاس، اعضای اشاره‌گر رو استفاده کنه. یعنی مثلاً تابع
‪<code>name()</code>‬ به این صورت در میاد:</p>
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-cpp" data-lang="cpp"><span class="line"><span class="cl"><span class="n">std</span><span class="o">::</span><span class="n">string</span> <span class="n">person</span><span class="o">::</span><span class="n">name</span><span class="p">()</span> <span class="k">const</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">m_impl</span><span class="o">-&gt;</span><span class="n">m_name</span><span class="p">;</span>
